12/data/attachments/d57ef67e65421c13.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_db3e76ae-7435-480c-8a61-666475832b79</nif:username>
            <nif:friendToBeAdded>John_certainly_Friend_68727_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>